---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyDouble
source: html/d8e06a30-efb0-33f1-1bba-e6d4a04166d9.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDouble

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetPropertyDouble : AssetProperty
```